dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_bf.h
/** \brief Mask for Ifx_MCDS_TCXACT_Bits.LV1 */
#define IFX_MCDS_TCXACT_LV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXACT_Bits.LV1 */
#define IFX_MCDS_TCXACT_LV1_OFF (15u)

/** \brief Length for Ifx_MCDS_TCXACT_Bits.AIS2 */
#define IFX_MCDS_TCXACT_AIS2_LEN (5u)

/** \brief Mask for Ifx_MCDS_TCXACT_Bits.AIS2 */
#define IFX_MCDS_TCXACT_AIS2_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_TCXACT_Bits.AIS2 */
#define IFX_MCDS_TCXACT_AIS2_OFF (16u)

/** \brief Length for Ifx_MCDS_TCXACT_Bits.AIQ2 */
#define IFX_MCDS_TCXACT_AIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCXACT_Bits.AIQ2 */
#define IFX_MCDS_TCXACT_AIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCXACT_Bits.AIQ2 */
#define IFX_MCDS_TCXACT_AIQ2_OFF (21u)

/** \brief Length for Ifx_MCDS_TCXACT_Bits.LV2 */
#define IFX_MCDS_TCXACT_LV2_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXACT_Bits.LV2 */
#define IFX_MCDS_TCXACT_LV2_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXACT_Bits.LV2 */
#define IFX_MCDS_TCXACT_LV2_OFF (23u)

/** \brief Length for Ifx_MCDS_TCXACT_Bits.AIS3 */
#define IFX_MCDS_TCXACT_AIS3_LEN (5u)

/** \brief Mask for Ifx_MCDS_TCXACT_Bits.AIS3 */
#define IFX_MCDS_TCXACT_AIS3_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_TCXACT_Bits.AIS3 */
#define IFX_MCDS_TCXACT_AIS3_OFF (24u)

/** \brief Length for Ifx_MCDS_TCXACT_Bits.AIQ3 */
#define IFX_MCDS_TCXACT_AIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCXACT_Bits.AIQ3 */
#define IFX_MCDS_TCXACT_AIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCXACT_Bits.AIQ3 */
#define IFX_MCDS_TCXACT_AIQ3_OFF (29u)

/** \brief Length for Ifx_MCDS_TCXACT_Bits.LV3 */
#define IFX_MCDS_TCXACT_LV3_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXACT_Bits.LV3 */
#define IFX_MCDS_TCXACT_LV3_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXACT_Bits.LV3 */
#define IFX_MCDS_TCXACT_LV3_OFF (31u)

/** \brief Length for Ifx_MCDS_TCXID_BND_Bits.BOUND */
#define IFX_MCDS_TCXID_BND_BOUND_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCXID_BND_Bits.BOUND */
#define IFX_MCDS_TCXID_BND_BOUND_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCXID_BND_Bits.BOUND */
#define IFX_MCDS_TCXID_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXID_RNG_Bits.RANGE */
#define IFX_MCDS_TCXID_RNG_RANGE_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCXID_RNG_Bits.RANGE */
#define IFX_MCDS_TCXID_RNG_RANGE_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCXID_RNG_Bits.RANGE */
#define IFX_MCDS_TCXID_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXID_MSK_Bits.MASK */
#define IFX_MCDS_TCXID_MSK_MASK_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCXID_MSK_Bits.MASK */
#define IFX_MCDS_TCXID_MSK_MASK_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCXID_MSK_Bits.MASK */
#define IFX_MCDS_TCXID_MSK_MASK_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXID_SGN_Bits.SIGN */
#define IFX_MCDS_TCXID_SGN_SIGN_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCXID_SGN_Bits.SIGN */
#define IFX_MCDS_TCXID_SGN_SIGN_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCXID_SGN_Bits.SIGN */
#define IFX_MCDS_TCXID_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MCDS_TCXIP_BND_BOUND_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MCDS_TCXIP_BND_BOUND_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MCDS_TCXIP_BND_BOUND_OFF (1u)

/** \brief Length for Ifx_MCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCXIP_RNG_RANGE_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCXIP_RNG_RANGE_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCXIP_RNG_RANGE_OFF (1u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.SUS */
#define IFX_MCDS_TCYDCSTS_SUS_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.SUS */
#define IFX_MCDS_TCYDCSTS_SUS_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.SUS */
#define IFX_MCDS_TCYDCSTS_SUS_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.IDLE */
#define IFX_MCDS_TCYDCSTS_IDLE_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.IDLE */
#define IFX_MCDS_TCYDCSTS_IDLE_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.IDLE */
#define IFX_MCDS_TCYDCSTS_IDLE_OFF (1u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.HALT */
#define IFX_MCDS_TCYDCSTS_HALT_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.HALT */
#define IFX_MCDS_TCYDCSTS_HALT_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.HALT */
#define IFX_MCDS_TCYDCSTS_HALT_OFF (2u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.ISR */
#define IFX_MCDS_TCYDCSTS_ISR_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.ISR */
#define IFX_MCDS_TCYDCSTS_ISR_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.ISR */
#define IFX_MCDS_TCYDCSTS_ISR_OFF (3u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.HBRK */
#define IFX_MCDS_TCYDCSTS_HBRK_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.HBRK */
#define IFX_MCDS_TCYDCSTS_HBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.HBRK */
#define IFX_MCDS_TCYDCSTS_HBRK_OFF (4u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.SBRK */
#define IFX_MCDS_TCYDCSTS_SBRK_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.SBRK */
#define IFX_MCDS_TCYDCSTS_SBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.SBRK */
#define IFX_MCDS_TCYDCSTS_SBRK_OFF (5u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.IEN */
#define IFX_MCDS_TCYDCSTS_IEN_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.IEN */
#define IFX_MCDS_TCYDCSTS_IEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.IEN */
#define IFX_MCDS_TCYDCSTS_IEN_OFF (7u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCYDCSTS_DBGEN_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCYDCSTS_DBGEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCYDCSTS_DBGEN_OFF (8u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCYDCSTS_CLKDIV_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCYDCSTS_CLKDIV_MSK (0x3u)

