dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_bf.h
/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ14 */
#define IFX_MCDS_SPBEVT_EIQ14_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ14 */
#define IFX_MCDS_SPBEVT_EIQ14_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ14 */
#define IFX_MCDS_SPBEVT_EIQ14_OFF (28u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ15 */
#define IFX_MCDS_SPBEVT_EIQ15_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ15 */
#define IFX_MCDS_SPBEVT_EIQ15_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ15 */
#define IFX_MCDS_SPBEVT_EIQ15_OFF (30u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.AIS0 */
#define IFX_MCDS_SPBACT_AIS0_LEN (5u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.AIS0 */
#define IFX_MCDS_SPBACT_AIS0_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.AIS0 */
#define IFX_MCDS_SPBACT_AIS0_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.AIQ0 */
#define IFX_MCDS_SPBACT_AIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.AIQ0 */
#define IFX_MCDS_SPBACT_AIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.AIQ0 */
#define IFX_MCDS_SPBACT_AIQ0_OFF (5u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.LV0 */
#define IFX_MCDS_SPBACT_LV0_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.LV0 */
#define IFX_MCDS_SPBACT_LV0_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.LV0 */
#define IFX_MCDS_SPBACT_LV0_OFF (7u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.AIS1 */
#define IFX_MCDS_SPBACT_AIS1_LEN (5u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.AIS1 */
#define IFX_MCDS_SPBACT_AIS1_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.AIS1 */
#define IFX_MCDS_SPBACT_AIS1_OFF (8u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.AIQ1 */
#define IFX_MCDS_SPBACT_AIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.AIQ1 */
#define IFX_MCDS_SPBACT_AIQ1_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.AIQ1 */
#define IFX_MCDS_SPBACT_AIQ1_OFF (13u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.LV1 */
#define IFX_MCDS_SPBACT_LV1_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.LV1 */
#define IFX_MCDS_SPBACT_LV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.LV1 */
#define IFX_MCDS_SPBACT_LV1_OFF (15u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.AIS2 */
#define IFX_MCDS_SPBACT_AIS2_LEN (5u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.AIS2 */
#define IFX_MCDS_SPBACT_AIS2_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.AIS2 */
#define IFX_MCDS_SPBACT_AIS2_OFF (16u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.AIQ2 */
#define IFX_MCDS_SPBACT_AIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.AIQ2 */
#define IFX_MCDS_SPBACT_AIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.AIQ2 */
#define IFX_MCDS_SPBACT_AIQ2_OFF (21u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.LV2 */
#define IFX_MCDS_SPBACT_LV2_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.LV2 */
#define IFX_MCDS_SPBACT_LV2_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.LV2 */
#define IFX_MCDS_SPBACT_LV2_OFF (23u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.AIS3 */
#define IFX_MCDS_SPBACT_AIS3_LEN (5u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.AIS3 */
#define IFX_MCDS_SPBACT_AIS3_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.AIS3 */
#define IFX_MCDS_SPBACT_AIS3_OFF (24u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.AIQ3 */
#define IFX_MCDS_SPBACT_AIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.AIQ3 */
#define IFX_MCDS_SPBACT_AIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.AIQ3 */
#define IFX_MCDS_SPBACT_AIQ3_OFF (29u)

/** \brief Length for Ifx_MCDS_SPBACT_Bits.LV3 */
#define IFX_MCDS_SPBACT_LV3_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBACT_Bits.LV3 */
#define IFX_MCDS_SPBACT_LV3_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBACT_Bits.LV3 */
#define IFX_MCDS_SPBACT_LV3_OFF (31u)

/** \brief Length for Ifx_MCDS_SRIDCSTS_Bits.EI */
#define IFX_MCDS_SRIDCSTS_EI_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRIDCSTS_Bits.EI */
#define IFX_MCDS_SRIDCSTS_EI_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRIDCSTS_Bits.EI */
#define IFX_MCDS_SRIDCSTS_EI_OFF (0u)

/** \brief Length for Ifx_MCDS_SRIDCSTS_Bits.SUS */
#define IFX_MCDS_SRIDCSTS_SUS_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRIDCSTS_Bits.SUS */
#define IFX_MCDS_SRIDCSTS_SUS_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRIDCSTS_Bits.SUS */
#define IFX_MCDS_SRIDCSTS_SUS_OFF (1u)

/** \brief Length for Ifx_MCDS_SRIDCSTS_Bits.ERR */
#define IFX_MCDS_SRIDCSTS_ERR_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRIDCSTS_Bits.ERR */
#define IFX_MCDS_SRIDCSTS_ERR_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRIDCSTS_Bits.ERR */
#define IFX_MCDS_SRIDCSTS_ERR_OFF (2u)

/** \brief Length for Ifx_MCDS_SRIDCSTS_Bits.SYSRES */
#define IFX_MCDS_SRIDCSTS_SYSRES_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRIDCSTS_Bits.SYSRES */
#define IFX_MCDS_SRIDCSTS_SYSRES_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRIDCSTS_Bits.SYSRES */
#define IFX_MCDS_SRIDCSTS_SYSRES_OFF (4u)

/** \brief Length for Ifx_MCDS_SRIDCSTS_Bits.APPRES */
#define IFX_MCDS_SRIDCSTS_APPRES_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRIDCSTS_Bits.APPRES */
#define IFX_MCDS_SRIDCSTS_APPRES_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRIDCSTS_Bits.APPRES */
#define IFX_MCDS_SRIDCSTS_APPRES_OFF (5u)

/** \brief Length for Ifx_MCDS_SRIDCSTS_Bits.CLKDIV */
#define IFX_MCDS_SRIDCSTS_CLKDIV_LEN (2u)

/** \brief Mask for Ifx_MCDS_SRIDCSTS_Bits.CLKDIV */
#define IFX_MCDS_SRIDCSTS_CLKDIV_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SRIDCSTS_Bits.CLKDIV */
#define IFX_MCDS_SRIDCSTS_CLKDIV_OFF (6u)

/** \brief Length for Ifx_MCDS_SRIDCSTS_Bits.SAFEEI */
#define IFX_MCDS_SRIDCSTS_SAFEEI_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRIDCSTS_Bits.SAFEEI */
#define IFX_MCDS_SRIDCSTS_SAFEEI_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRIDCSTS_Bits.SAFEEI */
#define IFX_MCDS_SRIDCSTS_SAFEEI_OFF (8u)

/** \brief Length for Ifx_MCDS_SRIDCSTS_Bits.SLEEP */
#define IFX_MCDS_SRIDCSTS_SLEEP_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRIDCSTS_Bits.SLEEP */
#define IFX_MCDS_SRIDCSTS_SLEEP_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRIDCSTS_Bits.SLEEP */
#define IFX_MCDS_SRIDCSTS_SLEEP_OFF (9u)

/** \brief Length for Ifx_MCDS_SRI1BALLUTD_Bits.DATA */
#define IFX_MCDS_SRI1BALLUTD_DATA_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1BALLUTD_Bits.DATA */
#define IFX_MCDS_SRI1BALLUTD_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1BALLUTD_Bits.DATA */
#define IFX_MCDS_SRI1BALLUTD_DATA_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1BALLUTA_Bits.ADDR */
#define IFX_MCDS_SRI1BALLUTA_ADDR_LEN (10u)

/** \brief Mask for Ifx_MCDS_SRI1BALLUTA_Bits.ADDR */
#define IFX_MCDS_SRI1BALLUTA_ADDR_MSK (0x3ffu)

