dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMcds_bf.h
/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ15 */
#define IFX_MCDS_TCZEVT_EIQ15_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ15 */
#define IFX_MCDS_TCZEVT_EIQ15_OFF (30u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.AIS0 */
#define IFX_MCDS_TCZACT_AIS0_LEN (5u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.AIS0 */
#define IFX_MCDS_TCZACT_AIS0_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.AIS0 */
#define IFX_MCDS_TCZACT_AIS0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.AIQ0 */
#define IFX_MCDS_TCZACT_AIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.AIQ0 */
#define IFX_MCDS_TCZACT_AIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.AIQ0 */
#define IFX_MCDS_TCZACT_AIQ0_OFF (5u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.LV0 */
#define IFX_MCDS_TCZACT_LV0_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.LV0 */
#define IFX_MCDS_TCZACT_LV0_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.LV0 */
#define IFX_MCDS_TCZACT_LV0_OFF (7u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.AIS1 */
#define IFX_MCDS_TCZACT_AIS1_LEN (5u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.AIS1 */
#define IFX_MCDS_TCZACT_AIS1_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.AIS1 */
#define IFX_MCDS_TCZACT_AIS1_OFF (8u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.AIQ1 */
#define IFX_MCDS_TCZACT_AIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.AIQ1 */
#define IFX_MCDS_TCZACT_AIQ1_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.AIQ1 */
#define IFX_MCDS_TCZACT_AIQ1_OFF (13u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.LV1 */
#define IFX_MCDS_TCZACT_LV1_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.LV1 */
#define IFX_MCDS_TCZACT_LV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.LV1 */
#define IFX_MCDS_TCZACT_LV1_OFF (15u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.AIS2 */
#define IFX_MCDS_TCZACT_AIS2_LEN (5u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.AIS2 */
#define IFX_MCDS_TCZACT_AIS2_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.AIS2 */
#define IFX_MCDS_TCZACT_AIS2_OFF (16u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.AIQ2 */
#define IFX_MCDS_TCZACT_AIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.AIQ2 */
#define IFX_MCDS_TCZACT_AIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.AIQ2 */
#define IFX_MCDS_TCZACT_AIQ2_OFF (21u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.LV2 */
#define IFX_MCDS_TCZACT_LV2_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.LV2 */
#define IFX_MCDS_TCZACT_LV2_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.LV2 */
#define IFX_MCDS_TCZACT_LV2_OFF (23u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.AIS3 */
#define IFX_MCDS_TCZACT_AIS3_LEN (5u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.AIS3 */
#define IFX_MCDS_TCZACT_AIS3_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.AIS3 */
#define IFX_MCDS_TCZACT_AIS3_OFF (24u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.AIQ3 */
#define IFX_MCDS_TCZACT_AIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.AIQ3 */
#define IFX_MCDS_TCZACT_AIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.AIQ3 */
#define IFX_MCDS_TCZACT_AIQ3_OFF (29u)

/** \brief Length for Ifx_MCDS_TCZACT_Bits.LV3 */
#define IFX_MCDS_TCZACT_LV3_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZACT_Bits.LV3 */
#define IFX_MCDS_TCZACT_LV3_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZACT_Bits.LV3 */
#define IFX_MCDS_TCZACT_LV3_OFF (31u)

/** \brief Length for Ifx_MCDS_TCZID_BND_Bits.BOUND */
#define IFX_MCDS_TCZID_BND_BOUND_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCZID_BND_Bits.BOUND */
#define IFX_MCDS_TCZID_BND_BOUND_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCZID_BND_Bits.BOUND */
#define IFX_MCDS_TCZID_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZID_RNG_Bits.RANGE */
#define IFX_MCDS_TCZID_RNG_RANGE_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCZID_RNG_Bits.RANGE */
#define IFX_MCDS_TCZID_RNG_RANGE_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCZID_RNG_Bits.RANGE */
#define IFX_MCDS_TCZID_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZID_MSK_Bits.MASK */
#define IFX_MCDS_TCZID_MSK_MASK_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCZID_MSK_Bits.MASK */
#define IFX_MCDS_TCZID_MSK_MASK_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCZID_MSK_Bits.MASK */
#define IFX_MCDS_TCZID_MSK_MASK_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZID_SGN_Bits.SIGN */
#define IFX_MCDS_TCZID_SGN_SIGN_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZID_SGN_Bits.SIGN */
#define IFX_MCDS_TCZID_SGN_SIGN_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZID_SGN_Bits.SIGN */
#define IFX_MCDS_TCZID_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZIP_BND_Bits.BOUND */
#define IFX_MCDS_TCZIP_BND_BOUND_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCZIP_BND_Bits.BOUND */
#define IFX_MCDS_TCZIP_BND_BOUND_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCZIP_BND_Bits.BOUND */
#define IFX_MCDS_TCZIP_BND_BOUND_OFF (1u)

/** \brief Length for Ifx_MCDS_TCZIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCZIP_RNG_RANGE_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCZIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCZIP_RNG_RANGE_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCZIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCZIP_RNG_RANGE_OFF (1u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXMCDS_BF_H */
